[net]
channels=3

[convolutional]
batch_normalize=1
filters=64
size=7
stride=2
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[route]
layers = -2

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

# 1-1

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=3
groups=32
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

# 1-2

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=3
groups=32
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

# 1-3

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=3
groups=32
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

# 1-T

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[route]
layers = -1,-16

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
groups=32
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=linear

[route]
layers = -2

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=linear

# 2-1

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
groups=32
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

# 2-2

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
groups=32
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

# 2-3

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
groups=32
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

# 2-T

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[route]
layers = -1,-16

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
groups=32
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=linear

[route]
layers = -2

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=linear

# 3-1

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
groups=32
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

# 3-2

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
groups=32
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

# 3-3

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
groups=32
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

# 3-4

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
groups=32
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

# 3-5

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
groups=32
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

# 3-T

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[route]
layers = -1,-24

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=3
groups=32
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=leaky

[route]
layers = -2

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=leaky

# 4-1

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=3
groups=32
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

# 4-2

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=3
groups=32
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

# 4-T

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=leaky

[route]
layers = -1,-12

[convolutional]
batch_normalize=1
filters=2048
size=1
stride=1
pad=1
activation=leaky

##########################

[sResMB]
ind_num=4
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[sResMB]
ind_num=4
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[sResMB]
ind_num=4
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

### SPP ###
[maxpool]
stride=1
size=5

[route]
layers=-2

[maxpool]
stride=1
size=9

[route]
layers=-4

[maxpool]
stride=1
size=13

[route]
layers=-1,-3,-5,-6
### End SPP ###

[sResMB]
ind_num=4
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[sResMB]
ind_num=4
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[sResMB]
ind_num=4
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[sResMB]
ind_num=4
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers = 65

[sResMB]
ind_num=4
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[route]
layers = -1, -3

[sResMB]
ind_num=4
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[sResMB]
ind_num=4
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[sResMB]
ind_num=4
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[sResMB]
ind_num=4
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[sResMB]
ind_num=4
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[sResMB]
ind_num=4
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers = 38

[sResMB]
ind_num=4
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[route]
layers = -1, -3

[sResMB]
ind_num=4
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[sResMB]
ind_num=4
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[sResMB]
ind_num=4
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[sResMB]
ind_num=4
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[sResMB]
ind_num=4
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

##########################

[sResMB]
ind_num=4
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=14
activation=linear


[yolo]
mask = 0,1
anchors = 102,101, 178,176, 263,261, 369,363, 524,520, 822,829
classes=1
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1

[route]
layers = -4

[sResMB]
ind_num=4
batch_normalize=1
size=3
stride=2
pad=1
filters=256
activation=leaky

[route]
layers = -1, -16

[sResMB]
ind_num=4
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[sResMB]
ind_num=4
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[sResMB]
ind_num=4
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[sResMB]
ind_num=4
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[sResMB]
ind_num=4
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[sResMB]
ind_num=4
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=14
activation=linear


[yolo]
mask = 2,3
anchors = 102,101, 178,176, 263,261, 369,363, 524,520, 822,829
classes=1
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1

[route]
layers = -4

[sResMB]
ind_num=4
batch_normalize=1
size=3
stride=2
pad=1
filters=512
activation=leaky

[route]
layers = -1, -37

[sResMB]
ind_num=4
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[sResMB]
ind_num=4
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[sResMB]
ind_num=4
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[sResMB]
ind_num=4
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[sResMB]
ind_num=4
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[sResMB]
ind_num=4
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=14
activation=linear


[yolo]
mask = 4,5
anchors = 102,101, 178,176, 263,261, 369,363, 524,520, 822,829
classes=1
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1